<h3>Introduction</h3>
This projects aims to encompass most core tasks for data analysis in SQL. <br> 
It includes techniques such as CTE's, subqueries, joins, and window functions and has tasks centered around employees of an organization.

In [3]:
# Installs package for magic sql functionality
!pip install jupysql -q

In [4]:
# Loads jupysql and connecting to local sqlite database
import sqlite3 

%load_ext sql
%sql sqlite:///SQL_database.db

Connecting to 'sqlite:///SQL_database.db'

**Creating tables for departments, employees, projects, assignments and salaries (Create Table, Drop Table)**

In [5]:
%%sql
DROP TABLE IF EXISTS departments;

CREATE TABLE
  departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
  );

DROP TABLE IF EXISTS employees;

CREATE TABLE
  employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    manager_id INTEGER,
    FOREIGN KEY (department_id) REFERENCES departments (department_id),
    FOREIGN KEY (manager_id) REFERENCES employees (employee_id)
  );

DROP TABLE IF EXISTS projects;

CREATE TABLE
  projects (
    project_id INTEGER PRIMARY KEY,
    project_name TEXT NOT NULL,
    start_date DATE,
    end_date DATE
  );

DROP TABLE IF EXISTS assignments;

CREATE TABLE
  assignments (
    assignment_id INTEGER PRIMARY KEY,
    employee_id INTEGER NOT NULL,
    project_id INTEGER NOT NULL,
    hours_worked REAL,
    FOREIGN KEY (employee_id) REFERENCES employees (employee_id),
    FOREIGN KEY (project_id) REFERENCES projects (project_id)
  );

DROP TABLE IF EXISTS salaries;

CREATE TABLE
  salaries (
    employee_id INTEGER NOT NULL,
    effective_date DATE NOT NULL,
    salary INTEGER,
    PRIMARY KEY (employee_id, effective_date),
    FOREIGN KEY (employee_id) REFERENCES employees (employee_id)
  );

Running query in 'sqlite:///SQL_database.db'

++
||
++
++

**Inserting data into tables (Insert or Ignore)**

In [6]:
%%sql
INSERT
OR IGNORE INTO departments (department_id, department_name)
VALUES
  (1, 'Finance'),
  (2, 'Marketing'),
  (3, 'Sales'),
  (4, 'IT');

INSERT
OR IGNORE INTO employees (employee_id, name, department_id, manager_id)
VALUES
  (1, 'Peter Robson', 1, NULL),
  (2, 'Bobby Fisher', 2, 1),
  (3, 'Sandy Layman', 2, 1),
  (4, 'Dudley Gruber', 3, 1),
  (5, 'Kevin Baker', 3, 4),
  (6, 'Julie Andrews', 4, 1),
  (7, 'Kim Terimi', 4, 6),
  (8, 'Henry Robson', 1, 1),
  (9, 'Jack Olson', 2, 2),
  (10, 'Eva Pettigrew', 3, 4);

INSERT
OR IGNORE INTO projects (project_id, project_name, start_date, end_date)
VALUES
  (
    1,
    'Marketing campaign',
    '2024-03-01',
    '2024-05-01'
  ),
  (2, 'New IT system', '2024-01-01', '2024-07-01'),
  (
    3,
    'E-commerce website',
    '2024-04-01',
    '2024-07-01'
  );

INSERT
OR IGNORE INTO assignments (
  assignment_id,
  employee_id,
  project_id,
  hours_worked
)
VALUES
  (1, 2, 1, 10.25),
  (2, 3, 1, 15),
  (3, 4, 3, 20),
  (4, 5, 3, 30),
  (5, 6, 2, 7),
  (6, 7, 2, 3),
  (7, 9, 1, 14),
  (8, 10, 3, 17);

INSERT
OR IGNORE INTO salaries (employee_id, effective_date, salary)
VALUES
  (1, '2024-01-01', 85000),
  (1, '2023-01-01', 82000),
  (1, '2022-01-01', 78000),
  (1, '2021-01-01', 75000),
  (1, '2020-01-01', 72000),
  (2, '2024-01-01', 72000),
  (2, '2023-01-01', 68000),
  (2, '2022-01-01', 65000),
  (3, '2024-01-01', 63000),
  (4, '2024-01-01', 75000),
  (4, '2023-01-01', 70000),
  (5, '2024-01-01', 70000),
  (5, '2023-01-01', 69000),
  (5, '2022-01-01', 68000),
  (5, '2021-01-01', 67000),
  (5, '2020-01-01', 66000),
  (5, '2019-01-01', 65000),
  (5, '2018-01-01', 64000),
  (6, '2024-01-01', 74000),
  (6, '2023-01-01', 70000),
  (6, '2022-01-01', 68000),
  (7, '2024-01-01', 69000),
  (7, '2023-01-01', 67000),
  (7, '2022-01-01', 65000),
  (8, '2024-01-01', 64000),
  (9, '2024-01-01', 61000),
  (10, '2024-01-01', 66000),
  (10, '2023-01-01', 64000),
  (10, '2022-01-01', 62000);

Running query in 'sqlite:///SQL_database.db'

4 rows affected.

10 rows affected.

3 rows affected.

8 rows affected.

29 rows affected.

++
||
++
++

In [7]:
# Removes the display limit
%config SqlMagic.displaylimit = None

displaylimit: Value None will be treated as 0 (no limit)

**All employees for the department with id 2 (Where)**

In [8]:
%%sql
SELECT
  *
FROM
  employees
WHERE
  department_id = 2;

Running query in 'sqlite:///SQL_database.db'

+-------------+--------------+---------------+------------+
| employee_id |     name     | department_id | manager_id |
+-------------+--------------+---------------+------------+
|      2      | Bobby Fisher |       2       |     1      |
|      3      | Sandy Layman |       2       |     1      |
|      9      |  Jack Olson  |       2       |     2      |
+-------------+--------------+---------------+------------+

**Unique employee ids (Distinct)**

In [9]:
%%sql
SELECT DISTINCT
  employee_id
FROM
  salaries;

Running query in 'sqlite:///SQL_database.db'

+-------------+
| employee_id |
+-------------+
|      1      |
|      2      |
|      3      |
|      4      |
|      5      |
|      6      |
|      7      |
|      8      |
|      9      |
|      10     |
+-------------+

**Top 5 salaries paid out ever (Limit)**

In [10]:
%%sql 
SELECT
  salary
FROM
  salaries
ORDER BY
  salary DESC
LIMIT
  5;

Running query in 'sqlite:///SQL_database.db'

+--------+
| salary |
+--------+
| 85000  |
| 82000  |
| 78000  |
| 75000  |
| 75000  |
+--------+

**Department name for each employee (Simple Join)**

In [11]:
%%sql
SELECT
  e.name,
  d.department_name
FROM
  employees e
  JOIN departments d ON e.department_id = d.department_id;

Running query in 'sqlite:///SQL_database.db'

+---------------+-----------------+
|      name     | department_name |
+---------------+-----------------+
|  Peter Robson |     Finance     |
|  Bobby Fisher |    Marketing    |
|  Sandy Layman |    Marketing    |
| Dudley Gruber |      Sales      |
|  Kevin Baker  |      Sales      |
| Julie Andrews |        IT       |
|   Kim Terimi  |        IT       |
|  Henry Robson |     Finance     |
|   Jack Olson  |    Marketing    |
| Eva Pettigrew |      Sales      |
+---------------+-----------------+

**Each employee's assigned project and assignment id (Double Join)**

In [12]:
%%sql 
SELECT
  e.name,
  p.project_name,
  a.assignment_id
FROM
  assignments a
  JOIN projects p ON a.project_id = p.project_id
  JOIN employees e ON a.employee_id = e.employee_id

Running query in 'sqlite:///SQL_database.db'

+---------------+--------------------+---------------+
|      name     |    project_name    | assignment_id |
+---------------+--------------------+---------------+
|  Bobby Fisher | Marketing campaign |       1       |
|  Sandy Layman | Marketing campaign |       2       |
| Dudley Gruber | E-commerce website |       3       |
|  Kevin Baker  | E-commerce website |       4       |
| Julie Andrews |   New IT system    |       5       |
|   Kim Terimi  |   New IT system    |       6       |
|   Jack Olson  | Marketing campaign |       7       |
| Eva Pettigrew | E-commerce website |       8       |
+---------------+--------------------+---------------+

**Number of employees assigned to each project (Group by)**

In [13]:
%%sql
SELECT
  p.project_name,
  COUNT(a.assignment_id)
FROM
  projects p
  JOIN assignments a ON p.project_id = a.project_id
GROUP BY
  project_name

Running query in 'sqlite:///SQL_database.db'

+--------------------+------------------------+
|    project_name    | COUNT(a.assignment_id) |
+--------------------+------------------------+
| E-commerce website |           3            |
| Marketing campaign |           3            |
|   New IT system    |           2            |
+--------------------+------------------------+

**Average hours worked on each project per employee (AVG function)**

In [56]:
%%sql
SELECT
  p.project_name,
  AVG(a.hours_worked) AS AVG_hours_worked_per_employee
FROM
  projects p
  JOIN assignments a ON p.project_id = a.project_id
GROUP BY
  p.project_name

Running query in 'sqlite:///SQL_database.db'

+--------------------+-------------------------------+
|    project_name    | AVG_hours_worked_per_employee |
+--------------------+-------------------------------+
| E-commerce website |       22.333333333333332      |
| Marketing campaign |       13.083333333333334      |
|   New IT system    |              5.0              |
+--------------------+-------------------------------+

**Employees that aren't assigned to any project (Left join)**

In [14]:
%%sql
SELECT
  e.name
FROM
  employees e
  LEFT JOIN assignments a ON e.employee_id = a.employee_id
WHERE
  a.employee_id IS NULL

Running query in 'sqlite:///SQL_database.db'

+--------------+
|     name     |
+--------------+
| Peter Robson |
| Henry Robson |
+--------------+

**Managers and their reports (Join with different keys)**

In [15]:
%%sql
SELECT
  e1.name AS manager,
  e2.name AS employee
FROM
  employees e1
  JOIN employees e2 ON e1.employee_id = e2.manager_id
ORDER BY
  manager

Running query in 'sqlite:///SQL_database.db'

+---------------+---------------+
|    manager    |    employee   |
+---------------+---------------+
|  Bobby Fisher |   Jack Olson  |
| Dudley Gruber |  Kevin Baker  |
| Dudley Gruber | Eva Pettigrew |
| Julie Andrews |   Kim Terimi  |
|  Peter Robson |  Bobby Fisher |
|  Peter Robson |  Sandy Layman |
|  Peter Robson | Dudley Gruber |
|  Peter Robson | Julie Andrews |
|  Peter Robson |  Henry Robson |
+---------------+---------------+

**Employee with the lowest salary compared to employee with highest salary (Min, Max and Union All)**

In [54]:
%%sql
SELECT
  e.name AS employee,
  MIN(s.salary) AS salary
FROM
  employees e
  JOIN salaries s ON e.employee_id = s.employee_id
WHERE
  effective_date LIKE "2024%"
UNION ALL
SELECT
  e.name,
  MAX(s.salary)
FROM
  employees e
  JOIN salaries s ON e.employee_id = s.employee_id
WHERE
  effective_date LIKE "2024%"

Running query in 'sqlite:///SQL_database.db'

+--------------+--------+
|   employee   | salary |
+--------------+--------+
|  Jack Olson  | 61000  |
| Peter Robson | 85000  |
+--------------+--------+

**Department id, name and salary of each department head (Subquery)**

In [16]:
%%sql
SELECT
  d.department_id,
  e.name,
  s.salary
FROM
  departments d
  JOIN employees e ON d.department_id = e.department_id
  JOIN salaries s ON e.employee_id = s.employee_id
WHERE
  (e.department_id, s.salary) IN (
    SELECT
      e.department_id,
      MAX(s.salary)
    FROM
      employees e
      JOIN salaries s ON e.employee_id = s.employee_id
    GROUP BY
      e.department_id
  )

Running query in 'sqlite:///SQL_database.db'

+---------------+---------------+--------+
| department_id |      name     | salary |
+---------------+---------------+--------+
|       1       |  Peter Robson | 85000  |
|       2       |  Bobby Fisher | 72000  |
|       3       | Dudley Gruber | 75000  |
|       4       | Julie Andrews | 74000  |
+---------------+---------------+--------+

**Employees' salary changes over time (LAG window function)**

In [17]:
%%sql
SELECT
  e.name,
  s.effective_date,
  s.salary,
  s.salary - LAG (s.salary) OVER (
    PARTITION BY
      s.employee_id
    ORDER BY
      s.effective_date
  ) AS Salary_increases
FROM
  salaries s
  JOIN employees e ON s.employee_id = e.employee_id
ORDER BY
  e.name

Running query in 'sqlite:///SQL_database.db'

+---------------+----------------+--------+------------------+
|      name     | effective_date | salary | Salary_increases |
+---------------+----------------+--------+------------------+
|  Bobby Fisher |   2022-01-01   | 65000  |       None       |
|  Bobby Fisher |   2023-01-01   | 68000  |       3000       |
|  Bobby Fisher |   2024-01-01   | 72000  |       4000       |
| Dudley Gruber |   2023-01-01   | 70000  |       None       |
| Dudley Gruber |   2024-01-01   | 75000  |       5000       |
| Eva Pettigrew |   2022-01-01   | 62000  |       None       |
| Eva Pettigrew |   2023-01-01   | 64000  |       2000       |
| Eva Pettigrew |   2024-01-01   | 66000  |       2000       |
|  Henry Robson |   2024-01-01   | 64000  |       None       |
|   Jack Olson  |   2024-01-01   | 61000  |       None       |
| Julie Andrews |   2022-01-01   | 68000  |       None       |
| Julie Andrews |   2023-01-01   | 70000  |       2000       |
| Julie Andrews |   2024-01-01   | 74000  |       4000       |
|  Kevin Baker  |   2018-01-01   | 64000  |       None       |
|  Kevin Baker  |   2019-01-01   | 65000  |       1000       |
|  Kevin Baker  |   2020-01-01   | 66000  |       1000       |
|  Kevin Baker  |   2021-01-01   | 67000  |       1000       |
|  Kevin Baker  |   2022-01-01   | 68000  |       1000       |
|  Kevin Baker  |   2023-01-01   | 69000  |       1000       |
|  Kevin Baker  |   2024-01-01   | 70000  |       1000       |
|   Kim Terimi  |   2022-01-01   | 65000  |       None       |
|   Kim Terimi  |   2023-01-01   | 67000  |       2000       |
|   Kim Terimi  |   2024-01-01   | 69000  |       2000       |
|  Peter Robson |   2020-01-01   | 72000  |       None       |
|  Peter Robson |   2021-01-01   | 75000  |       3000       |
|  Peter Robson |   2022-01-01   | 78000  |       3000       |
|  Peter Robson |   2023-01-01   | 82000  |       4000       |
|  Peter Robson |   2024-01-01   | 85000  |       3000       |
|  Sandy Layman |   2024-01-01   | 63000  |       None       |
+---------------+----------------+--------+------------------+

**Employees that has a department id (Where Exists)**

In [58]:
%%sql
SELECT
  e.name
FROM
  employees e
WHERE
  EXISTS (
    SELECT
      d.department_id
    FROM
      departments d
    WHERE
      e.department_id = d.department_id
  )

Running query in 'sqlite:///SQL_database.db'

+---------------+
|      name     |
+---------------+
|  Peter Robson |
|  Bobby Fisher |
|  Sandy Layman |
| Dudley Gruber |
|  Kevin Baker  |
| Julie Andrews |
|   Kim Terimi  |
|  Henry Robson |
|   Jack Olson  |
| Eva Pettigrew |
+---------------+

**Employees that have worked more hours than the average for that project (Join using subquery)**

In [19]:
%%sql
SELECT
  e.name,
  p.project_name,
  a.hours_worked,
  avg_proj.avg_hours_worked
FROM
  employees e
  JOIN assignments a ON e.employee_id = a.employee_id
  JOIN projects p ON a.project_id = p.project_id
  JOIN (
    SELECT
      project_id,
      AVG(hours_worked) AS avg_hours_worked
    FROM
      assignments
    GROUP BY
      project_id
  ) AS avg_proj ON a.project_id = avg_proj.project_id
WHERE
  a.hours_worked > avg_proj.avg_hours_worked;

Running query in 'sqlite:///SQL_database.db'

+---------------+--------------------+--------------+--------------------+
|      name     |    project_name    | hours_worked |  avg_hours_worked  |
+---------------+--------------------+--------------+--------------------+
|  Sandy Layman | Marketing campaign |     15.0     | 13.083333333333334 |
|  Kevin Baker  | E-commerce website |     30.0     | 22.333333333333332 |
| Julie Andrews |   New IT system    |     7.0      |        5.0         |
|   Jack Olson  | Marketing campaign |     14.0     | 13.083333333333334 |
+---------------+--------------------+--------------+--------------------+

**Employees that have worked more than 15 hours on their assigned project (CTE)**

In [20]:
%%sql
WITH
  total_hours AS (
    SELECT
      e.name AS name,
      a.hours_worked AS hours_worked
    FROM
      employees e
      JOIN assignments a ON e.employee_id = a.employee_id
  )
SELECT
  name,
  hours_worked
FROM
  total_hours
WHERE
  hours_worked > 15

Running query in 'sqlite:///SQL_database.db'

+---------------+--------------+
|      name     | hours_worked |
+---------------+--------------+
| Dudley Gruber |     20.0     |
|  Kevin Baker  |     30.0     |
| Eva Pettigrew |     17.0     |
+---------------+--------------+

**Classifying employees into groups based on their project hours (Case when)**

In [21]:
%%sql
SELECT e.name, a.hours_worked, 
    CASE WHEN a.hours_worked < 10 THEN "Low"
    WHEN a.hours_worked BETWEEN 10 AND 20 THEN "Medium"
    ELSE "High"
    END AS engagement
FROM employees e
    JOIN assignments a ON e.employee_id = a.employee_id
ORDER BY a.hours_worked

Running query in 'sqlite:///SQL_database.db'

+---------------+--------------+------------+
|      name     | hours_worked | engagement |
+---------------+--------------+------------+
|   Kim Terimi  |     3.0      |    Low     |
| Julie Andrews |     7.0      |    Low     |
|  Bobby Fisher |    10.25     |   Medium   |
|   Jack Olson  |     14.0     |   Medium   |
|  Sandy Layman |     15.0     |   Medium   |
| Eva Pettigrew |     17.0     |   Medium   |
| Dudley Gruber |     20.0     |   Medium   |
|  Kevin Baker  |     30.0     |    High    |
+---------------+--------------+------------+

**Showing employees and their salary, substituting any missing salary with 0 (Coalesce)**

In [22]:
%%sql
SELECT
  e.name,
  COALESCE(s.salary, 0) AS salary
FROM
  employees e
  LEFT JOIN (
    SELECT
      employee_id,
      MAX(salary) AS salary
    FROM
      salaries
    GROUP BY
      employee_id
  ) AS s ON e.employee_id = s.employee_id

Running query in 'sqlite:///SQL_database.db'

+---------------+--------+
|      name     | salary |
+---------------+--------+
|  Peter Robson | 85000  |
|  Bobby Fisher | 72000  |
|  Sandy Layman | 63000  |
| Dudley Gruber | 75000  |
|  Kevin Baker  | 70000  |
| Julie Andrews | 74000  |
|   Kim Terimi  | 69000  |
|  Henry Robson | 64000  |
|   Jack Olson  | 61000  |
| Eva Pettigrew | 66000  |
+---------------+--------+

**Employees rank by salary for each department (Rank window function)**

In [23]:
%%sql
SELECT
  e.name,
  d.department_name,
  RANK() OVER (
    PARTITION BY
      d.department_id
    ORDER BY
      s.salary DESC
  ) AS salary_rank,
  s.salary
FROM
  employees e
  JOIN (
    SELECT
      employee_id,
      MAX(salary) AS salary
    FROM
      salaries
    GROUP BY
      employee_id
  ) AS s ON e.employee_id = s.employee_id
  JOIN departments d ON e.department_id = d.department_id
WHERE
  e.employee_id = s.employee_id

Running query in 'sqlite:///SQL_database.db'

+---------------+-----------------+-------------+--------+
|      name     | department_name | salary_rank | salary |
+---------------+-----------------+-------------+--------+
|  Peter Robson |     Finance     |      1      | 85000  |
|  Henry Robson |     Finance     |      2      | 64000  |
|  Bobby Fisher |    Marketing    |      1      | 72000  |
|  Sandy Layman |    Marketing    |      2      | 63000  |
|   Jack Olson  |    Marketing    |      3      | 61000  |
| Dudley Gruber |      Sales      |      1      | 75000  |
|  Kevin Baker  |      Sales      |      2      | 70000  |
| Eva Pettigrew |      Sales      |      3      | 66000  |
| Julie Andrews |        IT       |      1      | 74000  |
|   Kim Terimi  |        IT       |      2      | 69000  |
+---------------+-----------------+-------------+--------+

**Cumulative hours worked on each project (SUM window function)**

In [24]:
%%sql
SELECT
  e.name,
  p.project_name,
  SUM(a.hours_worked) OVER (
    PARTITION BY
      p.project_name
    ORDER BY
      a.hours_worked
  ) AS cumulative_sum
FROM
  employees e
  JOIN assignments a ON e.employee_id = a.employee_id
  JOIN projects p ON a.project_id = p.project_id

Running query in 'sqlite:///SQL_database.db'

+---------------+--------------------+----------------+
|      name     |    project_name    | cumulative_sum |
+---------------+--------------------+----------------+
| Eva Pettigrew | E-commerce website |      17.0      |
| Dudley Gruber | E-commerce website |      37.0      |
|  Kevin Baker  | E-commerce website |      67.0      |
|  Bobby Fisher | Marketing campaign |     10.25      |
|   Jack Olson  | Marketing campaign |     24.25      |
|  Sandy Layman | Marketing campaign |     39.25      |
|   Kim Terimi  |   New IT system    |      3.0       |
| Julie Andrews |   New IT system    |      10.0      |
+---------------+--------------------+----------------+

**Total number of hours worked for projects that has a name starting with "new" (Having)**

In [25]:
%%sql
SELECT
  p.project_name,
  SUM(a.hours_worked) AS total_project_hours
FROM
  projects p
  JOIN assignments a ON p.project_id = a.project_id
GROUP BY
  project_name
HAVING
  p.project_name LIKE "new%"

Running query in 'sqlite:///SQL_database.db'

+---------------+---------------------+
|  project_name | total_project_hours |
+---------------+---------------------+
| New IT system |         10.0        |
+---------------+---------------------+

**Salaries of employees compared to the average salary for the department (CTE with joins and subquery)**

In [26]:
%%sql
WITH
  avg_dept_salary AS (
    SELECT
      e.department_id AS department_id,
      AVG(s.salary) AS avg_sal
    FROM
      salaries s
      JOIN employees e ON s.employee_id = e.employee_id
    GROUP BY
      e.department_id
  )
SELECT
  e.name,
  d.department_name,
  s.salary,
  avg_dept_salary.avg_sal,
  (s.salary - avg_dept_salary.avg_sal) AS salary_diff
FROM
  employees e
  JOIN (
    SELECT
      employee_id,
      MAX(salary) AS salary
    FROM
      salaries
    GROUP BY
      employee_id
  ) AS s ON e.employee_id = s.employee_id
  JOIN departments d ON e.department_id = d.department_id
  JOIN avg_dept_salary ON avg_dept_salary.department_id = d.department_id

Running query in 'sqlite:///SQL_database.db'

+---------------+-----------------+--------+-------------------+---------------------+
|      name     | department_name | salary |      avg_sal      |     salary_diff     |
+---------------+-----------------+--------+-------------------+---------------------+
|  Peter Robson |     Finance     | 85000  |      76000.0      |        9000.0       |
|  Bobby Fisher |    Marketing    | 72000  |      65800.0      |        6200.0       |
|  Sandy Layman |    Marketing    | 63000  |      65800.0      |       -2800.0       |
| Dudley Gruber |      Sales      | 75000  | 67166.66666666667 |  7833.3333333333285 |
|  Kevin Baker  |      Sales      | 70000  | 67166.66666666667 |  2833.3333333333285 |
| Julie Andrews |        IT       | 74000  | 68833.33333333333 |  5166.6666666666715 |
|   Kim Terimi  |        IT       | 69000  | 68833.33333333333 |  166.66666666667152 |
|  Henry Robson |     Finance     | 64000  |      76000.0      |       -12000.0      |
|   Jack Olson  |    Marketing    | 61000  |      65800.0      |       -4800.0       |
| Eva Pettigrew |      Sales      | 66000  | 67166.66666666667 | -1166.6666666666715 |
+---------------+-----------------+--------+-------------------+---------------------+

**Overview of employees, total salary, total project hours and manager for each department (CTE, joins, subqueries and union all)**

In [27]:
%%sql
WITH
  employee_stats AS (
    SELECT
      e.employee_id,
      COUNT(e.name) AS number_employees,
      SUM(s.salary) AS total_salary,
      SUM(a.hours_worked) AS project_hours
    FROM
      employees e
      JOIN (
        SELECT
          employee_id,
          MAX(salary) AS salary
        FROM
          salaries
        GROUP BY
          employee_id
      ) AS s ON e.employee_id = s.employee_id
      LEFT JOIN assignments a ON e.employee_id = a.employee_id
    GROUP BY
      e.department_id
  ),
  main_data AS (
    SELECT
      d.department_name,
      e.name,
      e_stats.number_employees,
      e_stats.total_salary,
      e_stats.project_hours
    FROM
      employee_stats e_stats
      JOIN employees e ON e.employee_id = e_stats.employee_id
      JOIN departments d ON e.department_id = d.department_id
  )
SELECT
  *
FROM
  main_data
UNION ALL
SELECT
  'TOTAL',
  '',
  SUM(number_employees),
  SUM(total_salary),
  SUM(project_hours)
FROM
  main_data

Running query in 'sqlite:///SQL_database.db'

+-----------------+---------------+------------------+--------------+---------------+
| department_name |      name     | number_employees | total_salary | project_hours |
+-----------------+---------------+------------------+--------------+---------------+
|     Finance     |  Peter Robson |        2         |    149000    |      None     |
|    Marketing    |  Bobby Fisher |        3         |    196000    |     39.25     |
|      Sales      | Dudley Gruber |        3         |    211000    |      67.0     |
|        IT       | Julie Andrews |        2         |    143000    |      10.0     |
|      TOTAL      |               |        10        |    699000    |     116.25    |
+-----------------+---------------+------------------+--------------+---------------+